/* nrzi.js
Реализуйте и экспортируйте по умолчанию функцию, которая принимает cтроку в виде
графического представления линейного сигнала и возвращает строку с бинарным кодом.

Примеры использования:
const signal1 = '_|¯|____|¯|__|¯¯¯';
nrzi(signal1); // '011000110100'

const signal2 = '|¯|___|¯¯¯¯¯|___|¯|_|¯';
nrzi(signal2); // '110010000100111'

const signal3 = '¯|___|¯¯¯¯¯|___|¯|_|¯';
nrzi(signal3); // '010010000100111'

Подсказки
Символ | в строке указывает на переключение сигнала и означает, что уровень сигнала в следующем такте,
будет изменён на противоположный по сравнению с предыдущим. */

// const nrzi = (signal) => signal
// .split('')
// .reduce((acc, el, i, arr) => {
//   if (el === '|') {
//     return acc;
//   }
//   return arr[i - 1] === '|'
//     ? [...acc, 1]
//     : [...acc, 0];
// }, [])
// .join('');

/* teacher solution */
const nrzi = (signal) => signal
  .split('')
  .map((el, i, arr) => {
    if (el === '|') {
      return '';
    }
    return arr[i - 1] === '|'
      ? 1
      : 0;
  })
  .join('');

export default nrzi;

/* testing */
// const signal1 = '_|¯|____|¯|__|¯¯¯';
// console.log(nrzi(signal1)); // '011000110100'

// const signal2 = '|¯|___|¯¯¯¯¯|___|¯|_|¯';
// console.log(nrzi(signal2)); // '110010000100111'
